app/views/tags/show.html.erb

<% end %>
<%= button_to("Add Tag", add_existing_tag_path(@tag), class: 'btn btn-primary', :method => :put) unless current_user.tags.include? @tag %>
---
SELECT  1 AS one FROM "tags" INNER JOIN "tags_users" ON "tags"."id" = "tags_users"."tag_id" WHERE "tags_users"."user_id" = ? AND "tags"."id" = ? LIMIT 1  [["user_id", 6], ["id", 1]]