app/views/posts/index.html.erb

  <p><%=post.user.created_at %></p>
  <a href="#"><%=link_to "Comments", post %><span class="badge"><%= post.comments.count %></span></a>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]

  <div class="panel-body">
  <% post.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = ?  [["post_id", 1]]