app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "dgdg"], ["post_id", 1], ["user_id", 4], ["created_at", "2015-12-02 01:46:41.477161"], ["updated_at", "2015-12-02 01:46:41.477161"]]
---
  def create
      post = Post.find(params[:id])
      comment =  Comment.new(body: params[:comment][:body], post_id: post.id, user_id: current_user.id)
      comment.save