app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 0]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", nil]]
---
  def show
    @post = Post.find(params[:id])
    @user = @post.user
    @comment = Comment.new
    @comments = Comment.where("post_id = ?", params[:id])

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "123123"], ["body", "1231415"], ["user_id", 2], ["created_at", "2015-12-01 01:55:52.750555"], ["updated_at", "2015-12-01 01:55:52.750555"]]
---
  def create


    if Post.new(title: params[:post][:title], body: params[:post][:body]).valid?
      post = Post.new(title: params[:post][:title], body: params[:post][:body], user_id: current_user.id)
      post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "coca-colagg"], ["updated_at", "2015-12-01 08:23:48.314562"], ["id", 4]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
---
  def destroy
      @post = Post.find(params[:id])