app/controllers/tags_controller.rb

   def create
    if Tag.new(name: params[:tag][:name], description: params[:tag][:name]).valid?
      relevant_tag_dict = {}
      Tag.all.each {|tag|  relevant_tag_dict[tag.name] = tag}
      if relevant_tag_dict.key? params[:tag][:name]
        tag = relevant_tag_dict[params[:tag][:name]]
      else
        tag = Tag.create(name: params[:tag][:name], description: params[:tag][:description])
      end
      current_user.tags << tag unless current_user.tags.include? tag
---
INSERT INTO "tags" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["description", "asdf"], ["created_at", "2015-12-03 03:43:42.534939"], ["updated_at", "2015-12-03 03:43:42.534939"]]
INSERT INTO "tags_users" ("user_id", "tag_id") VALUES (?, ?)  [["user_id", 6], ["tag_id", 7]]

    def add_existing
    	@tag = Tag.find(params[:id])
    	current_user.tags << @tag
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "tags_users" ("user_id", "tag_id") VALUES (?, ?)  [["user_id", 6], ["tag_id", 1]]